In [2]:
import pandas as pd
import numpy as np
import statsmodels.api as sm
import matplotlib.pyplot as plt
import datetime as dt
import random 
from itertools import cycle
from ipywidgets import widgets, interactive
from tqdm.autonotebook import tqdm
import datetime
import seaborn as sns


tqdm.pandas()
pd.set_option('max_columns', 50)
plt.style.use('bmh')
color_pal = plt.rcParams['axes.prop_cycle'].by_key()['color']
color_cycle = cycle(plt.rcParams['axes.prop_cycle'].by_key()['color'])

import sys
import warnings

if not sys.warnoptions:
    warnings.simplefilter("ignore")

C:\Users\conta\anaconda3\lib\site-packages\tqdm\std.py:658: FutureWarning: The Panel class is removed from pandas. Accessing it from the top-level namespace will also be removed in the next version
  from pandas import Panel

In [3]:
!jupyter nbextension enable --py --sys-prefix widgetsnbextension

Enabling notebook extension jupyter-js-widgets/extension...
      - Validating: ok

In [5]:
df_calendar  = pd.read_csv('D:/Coursework/Capstone/m5-forecasting-accuracy/calendar.csv')
df_calendar.head()

,date,wm_yr_wk,weekday,wday,month,year,d,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI
0,2011-01-29,11101,Saturday,1,1,2011,d_1,NaN,NaN,NaN,NaN,0,0,0
1,2011-01-30,11101,Sunday,2,1,2011,d_2,NaN,NaN,NaN,NaN,0,0,0
2,2011-01-31,11101,Monday,3,1,2011,d_3,NaN,NaN,NaN,NaN,0,0,0
3,2011-02-01,11101,Tuesday,4,2,2011,d_4,NaN,NaN,NaN,NaN,1,1,0
4,2011-02-02,11101,Wednesday,5,2,2011,d_5,NaN,NaN,NaN,NaN,1,0,1

In [6]:
df_calendar.shape

(1969, 14)

In [7]:
df_sell_prices = pd.read_csv('D:/Coursework/Capstone/m5-forecasting-accuracy/sell_prices.csv')
df_sell_prices.head()

  store_id        item_id  wm_yr_wk  sell_price
0     CA_1  HOBBIES_1_001     11325        9.58
1     CA_1  HOBBIES_1_001     11326        9.58
2     CA_1  HOBBIES_1_001     11327        8.26
3     CA_1  HOBBIES_1_001     11328        8.26
4     CA_1  HOBBIES_1_001     11329        8.26

In [8]:
df_sell_prices.shape

(6841121, 4)

In [12]:
print ("There are ", len(df_sell_prices['item_id'].unique()), " items sold across ", len(df_sell_prices['store_id'].unique()), " stores")

There are  3049  items sold across  10  stores

In [15]:
print ("Max priced product is priced @ $",max(df_sell_prices['sell_price']))
print ("Min priced product is priced @ $",min(df_sell_prices['sell_price']))
print ("Average price of the products is $",round(sum(df_sell_prices['sell_price'])/len(df_sell_prices['sell_price']),2))

Max priced product is priced @ $ 107.32
Min priced product is priced @ $ 0.01
Average price of the products is $ 4.41